Repository: heronalfo/e-commerce
Catalog: content/locale/*/LC_MESSAGES/django.po
Languages: es, pt

source: English
es: Inglés
pt: Inglês

source: Portuguese
es: Portugués
pt: Português

source: The username must not be longer than 32 characters
es: El nombre de usuario no debe tener más de 32 caracteres
pt: O nome de usuário não deve ter mais de 32 caracteres

source: This username has already been registered
es: Este nombre de usuario ya ha sido registrado
pt: Este nome de usuário já foi registrado

source: Password must contain at least 8 characters
es: La contraseña debe contener al menos 8 caracteres
pt: A senha deve conter pelo menos 8 caracteres

source: The name for username is invalid, it should be like: username-name
es: El nombre de usuario es inválido, debe ser como: nombre-de-usuario
pt: O nome de usuário é inválido, deve ser como: nome-de-usuário

source: The CPF sent does not comply with Brazilian standards. Example: 123.456.789.01
es: El CPF enviado no cumple con los estándares brasileños. Ejemplo: 123.456.789.01
pt: O CPF enviado não está em conformidade com os padrões brasileiros. Exemplo: 123.456.789.01

source: The CEP sent does not comply with Brazilian standards. Example: 12345-678
es: El CEP enviado no cumple con los estándares brasileños. Ejemplo: 12345-678
pt: O CEP enviado não está em conformidade com os padrões brasileiros. Exemplo: 12345-678

source: The NUMBER sent does not comply with Brazilian standards. Example: +55 (11) 9 1234 5678
es: El NÚMERO enviado no cumple con los estándares brasileños. Ejemplo: +55 (11) 9 1234 5678
pt: O NÚMERO enviado não está em conformidade com os padrões brasileiros. Exemplo: +55 (11) 9 1234 5678

source: The entered category does not exist in the database
es: La categoría ingresada no existe en la base de datos
pt: A categoria inserida não existe no banco de dados

source: The price must be greater than 0
es: El precio debe ser mayor que 0
pt: O preço deve ser maior que 0

source: It is not possible to register with a number less than 0
es: No es posible registrar un número menor que 0
pt: Não é possível registrar um número menor que 0

source: The entered product does not exist in the database
es: El producto ingresado no existe en la base de datos
pt: O produto inserido não existe no banco de dados

source: The rating cannot be less than 1 nor greater than 5
es: La calificación no puede ser inferior a 1 ni superior a 5
pt: A classificação não pode ser inferior a 1 nem superior a 5
